* Ссылки
1) Операции git  [[file:~/org/sbcl/Git-memo.org][Git-memo.org]]
2) [[file:~/org/sbcl/codex.org][Генерирование документации при помощи Codex]]
3) http://commondoc.github.io/codex/docs/tutorial.html
4) [[/home/namatv/.slynkrc]]

* Генерироване документации
#+name: pwd
#+BEGIN_SRC shell
pwd
#+END_SRC

#+RESULTS: pwd
: /home/namatv/quicklisp/local-projects/mnas/mnas-string

#+name: basename-pwd
#+BEGIN_SRC shell
basename `pwd`
#+END_SRC

#+RESULTS: basename-pwd
: mnas-string

#+name:make-graph
#+BEGIN_SRC lisp :var pwd=pwd :var basename-pwd=basename-pwd
  ;;;; (require :codex)
  ;;;; (require :mnas-package)
  ;;;;
  ;;;; (require :mnas-string)
  (let ((pkg :mnas-string)
	(fpath (concatenate
		'string
		(cond ((uiop:getenv "MSYS_HOME")) (t ""))
		pwd "/docs/build/"
		basename-pwd "/html/")))
    (codex:document pkg)
    (mnas-package:view-call-graph   pkg :out-type "png" :viewer nil :fpath fpath :fname "call-graph")
    (mnas-package:view-system-graph pkg :out-type "png" :viewer nil :fpath fpath :fname "system-graph")
    (mnas-package:view-class-graph  pkg :out-type "png" :viewer nil :fpath fpath :fname "class-graph")
    (mnas-package:view-symbol-graph pkg :out-type "png" :viewer nil :fpath fpath :fname "symbol-graph"))
#+END_SRC

#+RESULTS:
: #GRAPH(VC=23 RC=26)
: (T:"translit" T:"init-month-names" T:"split" T:"print-universal-date" T:"init-cir-gr->en" T:"init-space-cir-gr->en" T:"*cir-gr->en*" T:"*mon-ru*" T:"*space-cir-gr->en*" T:"*mon-en*" T:"*mon-ua*" T:"*omit-nulls*" T:"*default-month-language*" T:"*cyrillic->english-small-letter*" T:"*cyrillic-capital-letter*" T:"*cyrillic-small-letter*" T:"*greek->english-small-letter*" T:"*cyrillic->english-capital-letter*" T:"*greek-capital-letter*" T:"*space*" T:"*greek->english-capital-letter*" T:"*minus*" T:"*greek-small-letter*" )
: ((T:"translit"->T:"*cir-gr->en*") (T:"init-cir-gr->en"->T:"*cir-gr->en*") (T:"init-month-names"->T:"*mon-ru*") (T:"init-space-cir-gr->en"->T:"*space-cir-gr->en*") (T:"init-month-names"->T:"*mon-en*") (T:"init-month-names"->T:"*mon-ua*") (T:"split"->T:"*omit-nulls*") (T:"print-universal-date"->T:"*default-month-language*") (T:"init-cir-gr->en"->T:"*cyrillic->english-small-letter*") (T:"init-space-cir-gr->en"->T:"*cyrillic->english-small-letter*") (T:"init-cir-gr->en"->T:"*cyrillic-capital-letter*") (T:"init-space-cir-gr->en"->T:"*cyrillic-capital-letter*") (T:"init-cir-gr->en"->T:"*cyrillic-small-letter*") (T:"init-space-cir-gr->en"->T:"*cyrillic-small-letter*") (T:"init-cir-gr->en"->T:"*greek->english-small-letter*") (T:"init-space-cir-gr->en"->T:"*greek->english-small-letter*") (T:"init-cir-gr->en"->T:"*cyrillic->english-capital-letter*") (T:"init-space-cir-gr->en"->T:"*cyrillic->english-capital-letter*") (T:"init-cir-gr->en"->T:"*greek-capital-letter*") (T:"init-space-cir-gr->en"->T:"*greek-capital-letter*") (T:"init-space-cir-gr->en"->T:"*space*") (T:"init-cir-gr->en"->T:"*greek->english-capital-letter*") (T:"init-space-cir-gr->en"->T:"*greek->english-capital-letter*") (T:"init-space-cir-gr->en"->T:"*minus*") (T:"init-cir-gr->en"->T:"*greek-small-letter*") (T:"init-space-cir-gr->en"->T:"*greek-small-letter*") ))
* Публикация
#+name: copy-to-n133619
#+BEGIN_SRC shell :var make-graph=make-graph
  if [[ `hostname` == "mnasoft-00" ]]
  then
 echo "mnasoft-00"
      mkdir -p "$HOME/public_html/Common-Lisp-Programs/"
      rm -rf   "$HOME/public_html/Common-Lisp-Programs/`pwd`/"
      cp -rf ./docs/build/* "$HOME/public_html/Common-Lisp-Programs/"
  fi
  if [[ `hostname` == "ko11-118383" ]]
  then
      cp -rf ./docs/build/* "\\\\n133619\\home\\_namatv\\public_html\\Site\\Development\\Common-Lisp-Programs\\"
  fi

#+END_SRC

#+RESULTS: copy-to-n133619
: mnasoft-00

